/* Типы данных */

// string - строка
let name = 'Olya',
    name2 = 'Kolya',
    name3 = 'Sasha';

// number - число
let x = 5,
    y = 10,
    z = 15;

// boolean - булиевой тип данных
let flag = true,
    flag1 = false;

//undefined - пустота
let und = undefined;

//null - намеренная пустота
let n = null;

//Symbol - символ
let s = Symbol();

//Большое число  - bigint
let bigInt = 100n;

/* Операции и операторы */

// Математические +, -, *, /, %, (, ), ++, --, +=, *=, -=, /=,

// Булиевые ||, &&, !, !!, ===, !==, ==, !=, >, <, >=, <=

// конкатенация +

// Опреатор присвоение =



// Тернарные оперторы
// Логические выражения



