/*
 1) Сздайте 3 переменных булевого типа всеми способами, которые знаете
        Использовать:
      1) создание с помошью резульата выражения
      2) с помощью функции конструктора
      3) декларативный способ
 2) В чём разница между явным и неявным преращением типов
    Ответ: (Ответ написать тут)
    
 3) Какие значениия всех типов данных при прирощении в булевый тип возвращают false?
  (Написать с примером кода)
*/

// 4) Раскоментировать код, создать переменные (x, y) и подставить в них ЧИСЛОВЫЕ значение чтобы в консоль вышло сообщение
//   if ( x - y ) {
//     console.log('massage')
//   }

// 5) Раскоментировать код, создать переменные (x, y) и подставить в них СТРОКОВЫЕ значение чтобы в консоль вышло сообщение
//   if ( x + y ) {
//     console.log('massage')
//   }

// 6) Раскоментировать код, вместо x подставьте одну из переменных (a, b) так чтобы в консоль вышло сообщение
// let a = '';
// let b = ' ';
//
// if (!x) {
//   console.log('massage');
// }

// 7) Раскоментировать код, вместо переменных (x, y ,z, k) подставьте переменные (a, b, c ,d) так чтобы в консоль вышло сообщение
// let a = null;
// let b = undefined;
// let c = ' ';
// let d = NaN;
//
// if (!x && !y && !z && k) {
//   console.log('massage');
// }

// 8) Раскоментировать код, создать переменные (x) и подставить в них значение чтобы в консоль вышло сообщение
// if (Number.isNaN(x)) {
//   console.log('massage')
// }

// 9) Раскоментировать код, создать переменные (x, y, z, a, b) и подставить в них значения, каждая переменная должна иметь различный тип данных
// if (x && y && z && a && b) {
//   console.log('massage')
// }

// 10) Раскоментировать код, вместо x, y, z подставьте переменные a, b так чтобы в консоль вышло сообщение
// let a = true;
// let b = false;
//
// if ((x || y) && z) {
//   console.log('massage');
// }

// 11) Раскоментировать код, вместо x, y, z подставьте переменные a, b так чтобы в консоль вышло сообщение
// let a = true;
// let b = false;
//
// if (x && y || z) {
//   console.log('massage');
// }

// 12) Раскоментировать код, вместо x, y подставьте переменные a, b так чтобы в консоль вышло сообщение
// let a = 10;
// let b = 5;
//
// if ((x - z) < 0) {
//   console.log('massage');
// }

// 13) Раскоментировать код, вместо x, y, z подставьте переменные a, b, c так чтобы в консоль вышло сообщение
// let a = 10;
// let b = 'text';
// let c = !0;
//
// if (Number.isNaN(y - z) && x) {
//   console.log('massage');
// }

// 14) Раскоментировать код, создайте переменную x и присвойте ей знаяение так чтобы в консоль вышло сообщение 'message - 2'
// if (x) {
//   console.log('message - 1')
// } else {
//   console.log('message - 2')
// }

// 15) Раскоментировать код, вместо x, y, z подставьте переменные a, b, c так чтобы в консоль вышло сообщение 'message - 3'
// let a = 10;
// let b = ' ';
// let c = NaN
//
// if (x) {
//   console.log('message - 1')
// } else if (y) {
//   console.log('message - 2')
// } else if (z) {
//   console.log('message - 3')
// }

// 16) Какие операторы будевых выражений вы знаете
//   Ответ: (Ответ написать тут)

