/*
1. исправить ошибки задания 17
2. сделать шапку ютюба (svg)
3. Задачи:

1) Дан объект FamilyTree, выведете в консоль возраст собаки и имя сына.

const FamilyTree = {
   name: "Olga",
   age: 34,
   herSun: {
      name: 'Artemiy',
      age: 10,
      hisDog: {
         name: 'Sharik',
         age: 2
      }
   }
}

2)
   а) Создайте переменную и запишите в неё объект, который будет включать по свойсту на каждый примитивный тип.
   б) Преобразуйте каждое свойство этого объекта в его булевый эквивалент, неявным преобразованием типа
   
3)
   а) Создайте переменную и зпишите в неё объект с двумя произвольными свойтсвами
   б) Создайте вторую переменню и скопируйте в неё объект
   в) Измените свойство объекта, установленного во второй переменной, не обращаясь ко второй переменной

4) оздайте переменную и запишите в неё объект с произвольными свойствами и свойством, который должен являться произвольным объектом.

5)
   а) оздайте переменную и запишите в неё массив, который содержит все цвета радуги
   б) выведите в консоль красный, зелёный и фиеолетовые цвета
6)
   а) оздайте переменную и запишите в неё массив, который содержит 4 объекта со свойствми имя и возраст человека.
   б) выведите в консоль все имена
   
7) а) оздайте переменную и запишите в неё массив, который содержит 3 массива. 1й- список имён, 2й- список возрастов, 3й списко булевых значений
   б) вывести в консоль второе имя, второй возраст, второе булевое значение в списке.
   
8) Создайте вункцию, которая принимает в качестве аргумента любое значение. И возвращает его булевый эквиволент.

9) Создайте функцию, которая принимает в качестве аргументов два строковых значения и возвращает их конкатенацию.

10) Создайте функцию которая принимает первым аргументом число, а вторым булевое значение. Функция должна вернуть квадрат этого числа, если булевое значенеи true, и корень - если false.

11) Создайте функцию которая принимает:
   - первым аргументом любое имя (строка)
   - вторым аргументом любой возраст (число)
   - третьим аргументом булевое значение
   
   Функция должна возвращать объект со свойствами "name", "age", "isMan"

12) (Эта задача уже посложнее, использовать не только тело функции) Создайте функцию которая первые три вызова будет выводить в консоль сообщение "Hello world". После третьего ничего не будет выводить

13) Исправьте функцию так чтобы она возвращала 50

const fu = function () {
   const x = 100;
   return
   const y = x/2;
   return y;
}

14) Создайте функцию которая принимает в качестве аргументов 3 булевых аргумента и возвращает true если все 3 аргумента true, в противном случае функця должна возвращать false

15) Напишите функцию которая принимает  в качестве аргумента любое значение и возвращает тип данного значения (если не помнишь как узнать тип то посмотри в интернете)

16) Напишите функцию которая принимает в качестве аргумента любой объект, и возвращает объект с удалённым свойство "name"

*/

