// 1) написать функцию которая возвращает любое число
// 2) написать функцию которая принмает строку и выводит её в консоль
// 3) написать функцию которая принмает два числа и выводит в консоль их разность
// 4) написать функцию которая принмает объект и возвращает этот объект с новым свойстом "age" равным числу
// 5) написать функцию которая выводит в консоль текст "hello world" и возвращает данный текст
// 6) написать функцию которая принимает два числа и возвращает большее из них
// 7) написать функцию которая принимает два числа и возвращает меньшее из них
// 8) написать функцию которая принимает два числа и возвращает true если эти два числа равны
// 9) написать функцию которая принимает три значения любого типа и возвращает true если булевый эквивалент всех этих значений равен true
// 10) написать функцию которая принимает число и возвращает произведение этого числа на два
// 11) написать функцию которая принимает число и возвращает true если оно делится на два без остатка
// 12) написать функцию которая принимает число и возвращает true если оно делится на три без остатка
// 13) написать функцию которая принимает текст и возвращает его с восклицательным знаком на конце
// 14) написать функцию которая принимает значение любого типа и возвращает его булевый эквивалент (использовать явное приведение типа)
// 15) написать функцию которая принимает значение любого типа и возвращает его булевый эквивалент (использовать не явное приведение типа)
// 16) написать цикл который выводит в консоль числа от 0 до 10
// 17) написать цикл который выводит в консоль числа от 20 до 5
// 18) написать цикл который выводит в консоль те числа которые делятся на три без остатка от 0 до 100
// 19) написать цикл который выводит в консоль все значения произвольного массива





